# Модуль 10. Объектно-ориентированное
# программирование
# Тема: Классы. Объекты




# Задание 1
# Реализуйте класс «Человек». Необходимо хранить в
# полях класса: ФИО, дату рождения, контактный телефон,
# город, страну, домашний адрес. Реализуйте методы класса
# для ввода данных, вывода данных, реализуйте доступ к
# отдельным полям через методы класса.




# Задание 2
# Создайте класс «Город». Необходимо хранить в полях класса: название города, название региона, название
# страны, количество жителей в городе, почтовый индекс
# города, телефонный код города. Реализуйте методы класса
# для ввода данных, вывода данных, реализуйте доступ к
# отдельным полям через методы класса.
# Задание 3
# Создайте класс «Страна». Необходимо хранить в
# полях класса: название страны, название континента,
# количество жителей в стране, телефонный код страны,
# название столицы, название городов страны. Реализуйте
# Практическое задание
# 1
# методы класса для ввода данных, вывода данных, реализуйте доступ к отдельным полям через методы класса.
# Задание 4
# Создайте класс «Дробь». Необходимо хранить в полях
# класса: числитель и знаменатель. Реализуйте методы класса
# для ввода данных, вывода данных, реализуйте доступ к
# отдельным полям через методы класса. Также создайте
# методы класса для выполнения арифметических операций (сложение, вычитание, умножение, деление, и т.д.).